def get_sequence_value(key):
    # Словарь для хранения пар ключ-значение
    sequence_dict = {
        3: "12",
        4: "13",
        5: "1423",
        6: "121524",
        7: "162534",
        8: "13172635",
        9: "1218273645",
        10: "141923283746",
        11: "11029384756",
        12: "12131511124210394857",
        13: "112211310495867",
        14: "1611325212343114105968",
        15: "1214114232133124115106978",
        16: "1317115262143531341251161079",
        17: "11621531441351261171089",
        18: "12151811724272163631545414513612711810",
        19: "118217316415514613712811910",
        20: "13141911923282183731746416515614713812911"
    }
    
     # Проверьте, существует ли ключ в словаре, и верните соответствующее значение.
    return sequence_dict.get(key, "Ключ не найден")

# Запросить ключ у пользователя
try:
    key = int(input("Пожалуйста, введите ключ от 3 до 20: "))
    if 3 <= key <= 20:
        value = get_sequence_value(key)
        print(f"{key} - {value}")
    else:
        print("Неправильный ключ. Пожалуйста, введите ключ от 3 до 20.")
except ValueError:
    print("Неверный Ввод. Пожалуйста, введите действительный целочисленный ключ.")